In [1]:
import pandas as pd

In [2]:
df_a_transformar = pd.read_csv('./datasets/movies_dataset.csv')
df_a_transformar.head(2)

C:\Users\yesen\AppData\Local\Temp\ipykernel_17060\3562937757.py:1: DtypeWarning: Columns (10) have mixed types. Specify dtype option on import or set low_memory=False.
  df_a_transformar = pd.read_csv('./datasets/movies_dataset.csv')

,adult,belongs_to_collection,budget,genres,homepage,id,imdb_id,original_language,original_title,overview,...,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count
0,False,"{'id': 10194, 'name': 'Toy Story Collection', ...",30000000,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",http://toystory.disney.com/toy-story,862,tt0114709,en,Toy Story,"Led by Woody, Andy's toys live happily in his ...",...,1995-10-30,373554033.0,81.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,NaN,Toy Story,False,7.7,5415.0
1,False,NaN,65000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",NaN,8844,tt0113497,en,Jumanji,When siblings Judy and Peter discover an encha...,...,1995-12-15,262797249.0,104.0,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,Roll the dice and unleash the excitement!,Jumanji,False,6.9,2413.0

In [3]:
df_btc = df_a_transformar['belongs_to_collection']
df_btc.head(5)

0    {'id': 10194, 'name': 'Toy Story Collection', ...
1                                                  NaN
2    {'id': 119050, 'name': 'Grumpy Old Men Collect...
3                                                  NaN
4    {'id': 96871, 'name': 'Father of the Bride Col...
Name: belongs_to_collection, dtype: object

In [4]:
df_btc = df_btc.dropna()

In [5]:
df_btc.head()

0     {'id': 10194, 'name': 'Toy Story Collection', ...
2     {'id': 119050, 'name': 'Grumpy Old Men Collect...
4     {'id': 96871, 'name': 'Father of the Bride Col...
9     {'id': 645, 'name': 'James Bond Collection', '...
12    {'id': 117693, 'name': 'Balto Collection', 'po...
Name: belongs_to_collection, dtype: object

In [6]:
dict_list = df_btc.apply(eval).tolist()

In [11]:
in_list=[]
for i in range(len(dict_list)):
    if not type(dict_list[i]) == dict:
        print(dict_list[i])
        in_list.append(i)

print(in_list)

2.185485
[3809]

In [12]:
for i in range(len(in_list)):
    del dict_list[in_list[i]]

In [13]:
df_btc = pd.DataFrame(dict_list, columns=['id', 'name', 'poster_path', 'backdrop_path'])

In [14]:
df_btc.head()

,id,name,poster_path,backdrop_path
0,10194,Toy Story Collection,/7G9915LfUQ2lVfwMEEhDsn3kT4B.jpg,/9FBwqcd9IRruEDUrTdcaafOMKUq.jpg
1,119050,Grumpy Old Men Collection,/nLvUdqgPgm3F85NMCii9gVFUcet.jpg,/hypTnLot2z8wpFS7qwsQHW1uV8u.jpg
2,96871,Father of the Bride Collection,/nts4iOmNnq7GNicycMJ9pSAn204.jpg,/7qwE57OVZmMJChBpLEbJEmzUydk.jpg
3,645,James Bond Collection,/HORpg5CSkmeQlAolx3bKMrKgfi.jpg,/6VcVl48kNKvdXOZfJPdarlUGOsk.jpg
4,117693,Balto Collection,/w0ZgH6Lgxt2bQYnf1ss74UvYftm.jpg,/9VM5LiJV0bGb1st1KyHA3cVnO2G.jpg

In [15]:
lista_lis = df_a_transformar['genres']
df_genres =  lista_lis

In [16]:
df_genres.head()

0    [{'id': 16, 'name': 'Animation'}, {'id': 35, '...
1    [{'id': 12, 'name': 'Adventure'}, {'id': 14, '...
2    [{'id': 10749, 'name': 'Romance'}, {'id': 35, ...
3    [{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...
4                       [{'id': 35, 'name': 'Comedy'}]
Name: genres, dtype: object

In [17]:
dimentions = df_genres.shape
df = []
for i in range(dimentions[0]-1):
    lista_aux = str(df_genres.loc[i])
    lista_aux = eval(lista_aux)

    for dicc in lista_aux:
        df.append(dicc)

df_genres = pd.DataFrame(df)

In [18]:
df_genres

          id       name
0         16  Animation
1         35     Comedy
2      10751     Family
3         12  Adventure
4         14    Fantasy
...      ...        ...
91101  10751     Family
91102     18      Drama
91103     28     Action
91104     18      Drama
91105     53   Thriller

[91106 rows x 2 columns]

In [ ]:
df_a_transformar[['id','production_companies']].head(5)

      id                               production_companies
0    862     [{'name': 'Pixar Animation Studios', 'id': 3}]
1   8844  [{'name': 'TriStar Pictures', 'id': 559}, {'na...
2  15602  [{'name': 'Warner Bros.', 'id': 6194}, {'name'...
3  31357  [{'name': 'Twentieth Century Fox Film Corporat...
4  11862  [{'name': 'Sandollar Productions', 'id': 5842}...

In [19]:
df_production_companies = df_a_transformar['production_companies']
df_production_companies

0           [{'name': 'Pixar Animation Studios', 'id': 3}]
1        [{'name': 'TriStar Pictures', 'id': 559}, {'na...
2        [{'name': 'Warner Bros.', 'id': 6194}, {'name'...
3        [{'name': 'Twentieth Century Fox Film Corporat...
4        [{'name': 'Sandollar Productions', 'id': 5842}...
                               ...
45461                                                   []
45462               [{'name': 'Sine Olivia', 'id': 19653}]
45463    [{'name': 'American World Pictures', 'id': 6165}]
45464                 [{'name': 'Yermoliev', 'id': 88753}]
45465                                                   []
Name: production_companies, Length: 45466, dtype: object

In [21]:
df_production_companies = df_production_companies.dropna().reset_index(drop=True)

In [22]:
df_production_companies

0           [{'name': 'Pixar Animation Studios', 'id': 3}]
1        [{'name': 'TriStar Pictures', 'id': 559}, {'na...
2        [{'name': 'Warner Bros.', 'id': 6194}, {'name'...
3        [{'name': 'Twentieth Century Fox Film Corporat...
4        [{'name': 'Sandollar Productions', 'id': 5842}...
                               ...
45458                                                   []
45459               [{'name': 'Sine Olivia', 'id': 19653}]
45460    [{'name': 'American World Pictures', 'id': 6165}]
45461                 [{'name': 'Yermoliev', 'id': 88753}]
45462                                                   []
Name: production_companies, Length: 45463, dtype: object

In [23]:
mask = df_production_companies == "[]"
df_production_companies = df_production_companies[~mask].reset_index(drop = True)

In [24]:
df_production_companies

0           [{'name': 'Pixar Animation Studios', 'id': 3}]
1        [{'name': 'TriStar Pictures', 'id': 559}, {'na...
2        [{'name': 'Warner Bros.', 'id': 6194}, {'name'...
3        [{'name': 'Twentieth Century Fox Film Corporat...
4        [{'name': 'Sandollar Productions', 'id': 5842}...
                               ...
33583      [{'name': 'Concorde-New Horizons', 'id': 4688}]
33584    [{'name': 'Westdeutscher Rundfunk (WDR)', 'id'...
33585               [{'name': 'Sine Olivia', 'id': 19653}]
33586    [{'name': 'American World Pictures', 'id': 6165}]
33587                 [{'name': 'Yermoliev', 'id': 88753}]
Name: production_companies, Length: 33588, dtype: object

In [31]:
dimenciones = df_production_companies.shape
lista_de = []
for i in range(dimenciones[0]-1):
    s = df_production_companies.loc[i]
    lista_de.append(eval(s))

In [42]:
i = -1
lista_ind = []
for lista in lista_de:
    i+=1
    if type(lista) == bool:
        lista_ind.append(i)

lista_ind

[27252]

In [43]:
for index in lista_ind:
    lista_de.pop(index)

In [44]:
for_df = []
for lista in lista_de:
    for dicc in lista:
        for_df.append(dicc)

df_production_companies = pd.DataFrame(for_df)

In [45]:
df_production_companies.head()

                        name     id
0    Pixar Animation Studios      3
1           TriStar Pictures    559
2               Teitler Film   2550
3  Interscope Communications  10201
4               Warner Bros.   6194